{
    "scope":{
      "source":"icd-diseases",
      "source_description":"The ICD-10 Clinical Modification (ICD-10-CM) is a modification of the ICD-10, authorized by the World Health Organization, used as a source for diagnosis codes in the United States of America. ICD-10 is the 10th revision of the International Statistical Classification of Diseases and Related Health Problems, a medical classification list by the World Health Organization. It contains codes for diseases, signs and symptoms, abnormal findings, complaints, social circumstances, and external causes of injury or diseases. Work on ICD-10 began in 1983, became endorsed by the Forty-third World Health Assembly in 1990, and was first used by member states in 1994. It was replaced by ICD-11 on January 1, 2022. While WHO manages and publishes the base version of the ICD, several member states have modified it to better suit their needs. In the base classification, the code set allows for more than 14,000 different codes and permits the tracking of many new diagnoses compared to the preceding ICD-9. Through the use of optional sub-classifications, ICD-10 allows for specificity regarding the cause, manifestation, location, severity, and type of injury or disease. Source: Wikipedia",
      "tags":["ICD-10-CM"],
      "data_quality":"Official",
      "frequency":"daily",
      "frequency_start_hour":1,
      "frequency_end_hour":1,
      "reference_user":"Centers for Disease Control and Prevention, the national public health agency of the United States",
      "reporting_email":"",
      "globals":[
      ],
      "update_scope":[
        {"variable":"source"}
      ]
    },
    "acquisition":{
      "channel":{
        "name":"url",
        "url": "https://ftp.cdc.gov/pub/Health_Statistics/NCHS/Publications/ICD10CM/2022/Table%20and%20Index%20zip.zip"
      },
      "decompress":{
        "format":"zip",
        "path":["Table and Index/icd10cm-tabular-2022.xml"]
      },
      "format":{
        "name":"xml",
        "row":"//diag"
      }
    },
    "columns":[
      {"name":"code", "xpath":"name/text()", "variable":"pathogen_code", "action":"insert"},
      {"name":"name", "xpath":"desc/text()", "variable":"pathogen_name", "action":"insert"}
    ]
  }
